driver-tests/bpelse/samples/SampleProjectsMultiDepJBI/test/EndToEnd/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:end="http://xml.netbeans.org/schema/EndToEnd">
  <soapenv:Body>
    <end:typeA>
      <end:paramA>Hello World!!</end:paramA>
    </end:typeA>
  </soapenv:Body>
</soapenv:Envelope>